package com.ElementaryTasks.AtOnlineLessons;

public class Runner3 {
    public static void main(String[] args) {
        /*«3»: Ввести три числа, найти их сумму.
    Пример:
	 Введите три числа:
	 4
	 5
	 7
	 4+5+7=16

	 «5»: Ввести три числа, найти их сумму, произведение и среднее арифметическое.
    Пример:
             	Введите три числа:
	 4
	 5
	 7
	 4+5+7=16
	 4*5*7=140
	 (4+5+7)/3=5.333333

	 Условные
int num1 = 6;
if(num1>num2){
    System.out.println("Первое число больше второго");
}
else{
    System.out.println("Первое число меньше второго");
}

«3»: Ввести два целых числа, найти наибольшее и наименьшее из них.
Пример:
Введите два целых числа:
1 5
Наибольшее число 5
Наименьшее число 1


«4»: Ввести четыре целых числа, найти наибольшее из них.
Пример:
Введите четыре целых числа:
1 5 4 3
Наибольшее число 5


*/
    }
}
